xlrs-dev/xlrs/src/rc_rp2350_crsf_main.cpp
#ifndef UNIT_TEST

#include <Arduino.h>
#include <EEPROM.h>
#include <stdio.h>
#include <string.h>

#include <string>
#include <vector>

#include "lora_link/protocol.h"
#include "rc_handset/config/config.h"
#include "rc_handset/core1/Runtime.h"
#include "rc_handset/display/OledDisplay.h"
#include "rc_handset/input/ArduinoInputSampler.h"
#include "rc_handset/power/Rp2350Power.h"
#include "rc_handset/telemetry/HandsetTelemetry.h"
#include "rc_handset/usb/protocol.h"

using namespace lora_link;
namespace handset_config = rc_handset::config;
using rc_handset::core1::LiveStateSnapshot;
namespace handset_power = rc_handset::power;
namespace handset_input = rc_handset::input;
namespace handset_telemetry = rc_handset::telemetry;
namespace handset_usb = rc_handset::usb;

#ifndef CRSF_UART_TX_PIN
#define CRSF_UART_TX_PIN 8
#endif

#ifndef CRSF_UART_RX_PIN
#define CRSF_UART_RX_PIN 9
#endif

#ifndef RC_CRSF_SIMPLETX_FRAME_US
#define RC_CRSF_SIMPLETX_FRAME_US 2000u
#endif

#ifndef DEFAULT_BINDING_PHRASE
#define DEFAULT_BINDING_PHRASE "default"
#endif

#ifndef RC_TX_BATTERY_ADC_FULL_SCALE_MV
#define RC_TX_BATTERY_ADC_FULL_SCALE_MV 3300u
#endif

#ifndef RC_TX_BATTERY_EMPTY_MV
#define RC_TX_BATTERY_EMPTY_MV 3300u
#endif

#ifndef RC_TX_BATTERY_FULL_MV
#define RC_TX_BATTERY_FULL_MV 4200u
#endif

static constexpr uint16_t kAdcMax = 4095;
static constexpr uint32_t kDisplayIntervalMs = 100;
static constexpr uint32_t kDisplayPageMs = 2500;
static constexpr uint32_t kLinkTelemetryFreshMs = 1500;
static constexpr uint8_t kCrsfAddressFlightController = 0xC8;
static constexpr uint8_t kCrsfAddressRadioTransmitter = 0xEA;
static constexpr uint8_t kCrsfAddressCrsfTransmitter = 0xEE;
static constexpr uint8_t kCrsfFrameLinkStatistics = 0x14;
static constexpr uint8_t kCrsfFrameBatterySensor = 0x08;

static uint32_t g_lastDisplayMs = 0;
static uint32_t g_lastStreamStateMs = 0;
static uint32_t g_lastTxBindingProbeMs = 0;
static uint32_t g_streamStateIntervalMs = 0;
static bool g_streamStateEnabled = false;
static rc_handset::core1::ConfigSnapshot g_activeConfig = rc_handset::core1::makeDefaultConfigSnapshot();
static rc_handset::core1::ConfigSnapshot g_pendingConfig = rc_handset::core1::makeDefaultConfigSnapshot();
static bool g_configFault = false;
static bool g_calibrating = false;
static uint16_t g_calMin[handset_config::kRcHandsetAxisCount] = {};
static uint16_t g_calCenter[handset_config::kRcHandsetAxisCount] = {};
static uint16_t g_calMax[handset_config::kRcHandsetAxisCount] = {};
static LiveStateSnapshot g_liveState = rc_handset::core1::makeDefaultLiveStateSnapshot();
static rc_handset::display::OledDisplay g_display;
static handset_telemetry::HandsetTelemetry g_handsetTelemetry(
    {100u, 1500u, kLinkTelemetryFreshMs, 5000u});
static BindingStatus g_txBindingStatus = {};
static bool g_haveTxBindingStatus = false;

static const char* bindingResultName(BindingResult result) {
    switch (result) {
        case BindingResult::Ok:
            return "ok";
        case BindingResult::InvalidCommand:
            return "invalid_command";
        case BindingResult::InvalidPhrase:
            return "invalid_phrase";
        case BindingResult::PersistFailed:
            return "persist_failed";
        default:
            return "unknown";
    }
}

static std::string uidHexString(const uint8_t uid[kUidSize]) {
    static constexpr char kHex[] = "0123456789ABCDEF";
    std::string out;
    out.reserve(kUidSize * 2);
    for (uint8_t i = 0; i < kUidSize; ++i) {
        out += kHex[(uid[i] >> 4) & 0x0F];
        out += kHex[uid[i] & 0x0F];
    }
    return out;
}

static std::string uidCheckHexString(uint32_t uidCheck) {
    char out[9];
    snprintf(out, sizeof(out), "%08lX", static_cast<unsigned long>(uidCheck));
    return std::string(out);
}

static uint16_t readAveragedAdc(uint8_t pin) {
    uint32_t sum = 0;
    for (uint8_t i = 0; i < 8; ++i) sum += analogRead(pin);
    return static_cast<uint16_t>((sum + 4) / 8);
}

static uint16_t readAxisAdc(uint8_t axis) {
    const handset_input::ArduinoInputPins pins = handset_input::defaultRp2350InputPins();
    if (axis >= handset_config::kRcHandsetAxisCount) return 0;
    return readAveragedAdc(pins.analog[axis]);
}

static std::string joinU16(const uint16_t* values, uint8_t count) {
    std::string out;
    for (uint8_t i = 0; i < count; ++i) {
        if (i) out += ",";
        out += std::to_string(values[i]);
    }
    return out;
}

static std::string configCalMinString(const handset_config::RcHandsetConfig& cfg) {
    uint16_t values[handset_config::kRcHandsetAxisCount];
    for (uint8_t i = 0; i < handset_config::kRcHandsetAxisCount; ++i) values[i] = cfg.axes[i].calibration.min;
    return joinU16(values, handset_config::kRcHandsetAxisCount);
}

static std::string configCalCenterString(const handset_config::RcHandsetConfig& cfg) {
    uint16_t values[handset_config::kRcHandsetAxisCount];
    for (uint8_t i = 0; i < handset_config::kRcHandsetAxisCount; ++i) values[i] = cfg.axes[i].calibration.center;
    return joinU16(values, handset_config::kRcHandsetAxisCount);
}

static std::string configCalMaxString(const handset_config::RcHandsetConfig& cfg) {
    uint16_t values[handset_config::kRcHandsetAxisCount];
    for (uint8_t i = 0; i < handset_config::kRcHandsetAxisCount; ++i) values[i] = cfg.axes[i].calibration.max;
    return joinU16(values, handset_config::kRcHandsetAxisCount);
}

static std::string configAxisBoolString(const handset_config::RcHandsetConfig& cfg) {
    std::string out;
    for (uint8_t i = 0; i < handset_config::kRcHandsetAxisCount; ++i) {
        if (i) out += ",";
        out += cfg.axes[i].inverted ? "1" : "0";
    }
    return out;
}

static std::string configAxisDeadzoneString(const handset_config::RcHandsetConfig& cfg) {
    uint16_t values[handset_config::kRcHandsetAxisCount];
    for (uint8_t i = 0; i < handset_config::kRcHandsetAxisCount; ++i) values[i] = cfg.axes[i].deadzone;
    return joinU16(values, handset_config::kRcHandsetAxisCount);
}

