xlrs-dev/xlrs/src/rc_rp2350_crsf_main.cpp
static std::string configAxisFunctionString(const handset_config::RcHandsetConfig& cfg) {
    std::string out;
    for (uint8_t i = 0; i < handset_config::kRcHandsetAxisCount; ++i) {
        if (i) out += ",";
        out += std::to_string(static_cast<unsigned>(cfg.axes[i].function));
    }
    return out;
}

static std::string configChannelTrimString(const handset_config::RcHandsetConfig& cfg) {
    std::string out;
    for (uint8_t i = 0; i < handset_config::kRcHandsetChannelCount; ++i) {
        if (i) out += ",";
        out += std::to_string(cfg.channels[i].trim);
    }
    return out;
}

static std::string configChannelCutoffMinString(const handset_config::RcHandsetConfig& cfg) {
    uint16_t values[handset_config::kRcHandsetChannelCount];
    for (uint8_t i = 0; i < handset_config::kRcHandsetChannelCount; ++i) values[i] = cfg.channels[i].cutoffMin;
    return joinU16(values, handset_config::kRcHandsetChannelCount);
}

static std::string configChannelCutoffMaxString(const handset_config::RcHandsetConfig& cfg) {
    uint16_t values[handset_config::kRcHandsetChannelCount];
    for (uint8_t i = 0; i < handset_config::kRcHandsetChannelCount; ++i) values[i] = cfg.channels[i].cutoffMax;
    return joinU16(values, handset_config::kRcHandsetChannelCount);
}

static std::string configFilterString(const handset_config::RcHandsetConfig& cfg) {
    return std::to_string(cfg.filter.adcSamples) + "," +
           std::to_string(cfg.filter.smoothingPercent) + ",0,0";
}

static std::vector<handset_usb::ResponseField> configResponseFields(const handset_config::RcHandsetConfig& cfg) {
    return {
        {"version", "1"},
        {"cal_min", configCalMinString(cfg)},
        {"cal_center", configCalCenterString(cfg)},
        {"cal_max", configCalMaxString(cfg)},
        {"invert", configAxisBoolString(cfg)},
        {"deadzone", configAxisDeadzoneString(cfg)},
        {"function", configAxisFunctionString(cfg)},
        {"trim", configChannelTrimString(cfg)},
        {"cutoff_min", configChannelCutoffMinString(cfg)},
        {"cutoff_max", configChannelCutoffMaxString(cfg)},
        {"filter", configFilterString(cfg)},
        {"filter.low_pass", std::to_string(cfg.filter.smoothingPercent)},
        {"filter.high_pass", "0"},
    };
}

static bool parseInt(const std::string& value, int32_t& out) {
    if (value.empty()) return false;
    char* end = nullptr;
    const long parsed = strtol(value.c_str(), &end, 10);
    if (!end || *end != '\0') return false;
    out = static_cast<int32_t>(parsed);
    return true;
}

static bool parseIndexField(const std::string& field, const char* prefix, uint8_t limit, uint8_t& index) {
    const size_t prefixLen = strlen(prefix);
    if (field.compare(0, prefixLen, prefix) != 0) return false;
    int32_t parsed = 0;
    if (!parseInt(field.substr(prefixLen), parsed) || parsed < 0 || parsed >= limit) return false;
    index = static_cast<uint8_t>(parsed);
    return true;
}

static bool applyPendingConfigField(const std::string& field, const std::string& value) {
    int32_t parsed = 0;
    uint8_t index = 0;
    handset_config::RcHandsetConfig& cfg = g_pendingConfig.handsetConfig;

    if (field == "filter") {
        int values[4] = {0, 0, 0, 0};
        const char* cursor = value.c_str();
        char* end = nullptr;
        for (uint8_t i = 0; i < 4; ++i) {
            values[i] = static_cast<int>(strtol(cursor, &end, 10));
            if (end == cursor) return false;
            if (i < 3) {
                if (*end != ',') return false;
                cursor = end + 1;
            }
        }
        cfg.filter.adcSamples = static_cast<uint8_t>(values[0]);
        cfg.filter.smoothingPercent = static_cast<uint8_t>(values[1]);
        return handset_config::validateRcHandsetConfig(cfg);
    }

    if (!parseInt(value, parsed)) return false;

    if (parseIndexField(field, "cal.min.", handset_config::kRcHandsetAxisCount, index)) {
        cfg.axes[index].calibration.min = static_cast<uint16_t>(parsed);
    } else if (parseIndexField(field, "cal.center.", handset_config::kRcHandsetAxisCount, index)) {
        cfg.axes[index].calibration.center = static_cast<uint16_t>(parsed);
    } else if (parseIndexField(field, "cal.max.", handset_config::kRcHandsetAxisCount, index)) {
        cfg.axes[index].calibration.max = static_cast<uint16_t>(parsed);
    } else if (parseIndexField(field, "axis.invert.", handset_config::kRcHandsetAxisCount, index)) {
        cfg.axes[index].inverted = parsed != 0;
    } else if (parseIndexField(field, "axis.deadzone.", handset_config::kRcHandsetAxisCount, index)) {
        cfg.axes[index].deadzone = static_cast<uint16_t>(parsed);
    } else if (parseIndexField(field, "axis.function.", handset_config::kRcHandsetAxisCount, index)) {
        cfg.axes[index].function = static_cast<handset_config::ChannelFunction>(parsed);
    } else if (parseIndexField(field, "channel.trim.", handset_config::kRcHandsetChannelCount, index)) {
        cfg.channels[index].trim = static_cast<int16_t>(parsed);
    } else if (parseIndexField(field, "channel.cutoff_min.", handset_config::kRcHandsetChannelCount, index)) {
        cfg.channels[index].cutoffMin = static_cast<uint16_t>(parsed);
    } else if (parseIndexField(field, "channel.cutoff_max.", handset_config::kRcHandsetChannelCount, index)) {
        cfg.channels[index].cutoffMax = static_cast<uint16_t>(parsed);
    } else if (field == "filter.low_pass") {
        cfg.filter.smoothingPercent = static_cast<uint8_t>(parsed);
    } else if (field == "filter.high_pass") {
        return true;
    } else {
        return false;
    }
    return handset_config::validateRcHandsetConfig(cfg);
}

static bool saveRcConfig() {
    uint8_t record[handset_config::kRcHandsetConfigRecordSize];
    size_t written = 0;
    if (!handset_config::encodeRcHandsetConfigRecord(g_activeConfig.handsetConfig, record, sizeof(record), written)) {
        return false;
    }
    for (size_t i = 0; i < written; ++i) EEPROM.write(i, record[i]);
    return EEPROM.commit();
}

static void loadRcConfig() {
    EEPROM.begin(256);
    uint8_t record[handset_config::kRcHandsetConfigRecordSize];
    for (size_t i = 0; i < sizeof(record); ++i) record[i] = EEPROM.read(i);
    handset_config::RcHandsetConfig stored{};
    if (handset_config::decodeRcHandsetConfigRecord(record, sizeof(record), stored)) {
        g_activeConfig.handsetConfig = stored;
        g_configFault = false;
    } else {
        g_activeConfig.handsetConfig = handset_config::defaultRcHandsetConfig();
        g_configFault = false;
    }
    g_activeConfig.crsfFrameIntervalUs = rc_handset::core1::kDefaultCrsfFrameIntervalUs;
    g_pendingConfig = g_activeConfig;
}

static void publishActiveConfig() {
    g_activeConfig.generation = rc_handset::core1::publishConfig(g_activeConfig);
    g_pendingConfig = g_activeConfig;
}

