xlrs-dev/xlrs/src/rc_rp2350_crsf_main.cpp
static void collectCurrentAdc(uint16_t out[handset_config::kRcHandsetAxisCount]) {
    for (uint8_t axis = 0; axis < handset_config::kRcHandsetAxisCount; ++axis) out[axis] = readAxisAdc(axis);
}

static std::string currentAdcString() {
    uint16_t values[handset_config::kRcHandsetAxisCount];
    collectCurrentAdc(values);
    return joinU16(values, handset_config::kRcHandsetAxisCount);
}

static void refreshLiveState() {
    rc_handset::core1::readLiveState(g_liveState);
}

static bool isCrsfAddress(uint8_t value) {
    return value == kCrsfAddressFlightController ||
           value == kCrsfAddressRadioTransmitter ||
           value == kCrsfAddressCrsfTransmitter;
}

static bool parseCrsfTelemetryByte(uint8_t byte, uint8_t frame[64], uint8_t& frameLen) {
    static uint8_t pos = 0;
    if (pos == 0 && !isCrsfAddress(byte)) return false;
    frame[pos++] = byte;
    if (pos == 2 && (frame[1] < 2 || frame[1] > 62)) {
        pos = 0;
        return false;
    }
    if (pos >= 2 && pos == static_cast<uint8_t>(frame[1] + 2)) {
        frameLen = pos;
        pos = 0;
        return crsfCrc8(&frame[2], frame[1] - 1) == frame[frameLen - 1];
    }
    if (pos >= 64) pos = 0;
    return false;
}

static RateId rateIdFromCrsfRfMode(uint8_t rfMode) {
    return rfMode == static_cast<uint8_t>(RateId::L250) ? RateId::L250 : RateId::L100;
}

static uint32_t defaultBindingUidCheck() {
    uint8_t uid[kUidSize];
    deriveUid(DEFAULT_BINDING_PHRASE, uid);
    return uidCheck(uid);
}

static void cacheTxBindingStatus(const BindingStatus& status) {
    g_txBindingStatus = status;
    g_haveTxBindingStatus = true;
}

static const char* displayBindingPhrase() {
    return g_haveTxBindingStatus ? g_txBindingStatus.phrase : DEFAULT_BINDING_PHRASE;
}

static uint32_t expectedTxUidCheck() {
    return g_haveTxBindingStatus ? g_txBindingStatus.uidCheck : defaultBindingUidCheck();
}

static void publishTxBindingTelemetry(bool present, const BindingStatus* status, uint32_t nowMs) {
    if (status) cacheTxBindingStatus(*status);
    const handset_telemetry::HandsetTelemetryState& state = g_handsetTelemetry.state();
    const bool haveExpectedUid = g_haveTxBindingStatus || status != nullptr;
    const uint32_t expectedUid = status ? status->uidCheck : expectedTxUidCheck();
    const bool haveObservedUid = status != nullptr || state.haveObservedUidCheck;
    const uint32_t observedUid = status ? status->uidCheck : state.observedUidCheck;
    g_handsetTelemetry.updateTxStatus(present,
                                      haveExpectedUid,
                                      expectedUid,
                                      haveObservedUid,
                                      observedUid,
                                      state.activeRate,
                                      nowMs);
}

static uint8_t percentFromMillivolts(uint16_t millivolts) {
    if (millivolts <= RC_TX_BATTERY_EMPTY_MV) return 0;
    if (millivolts >= RC_TX_BATTERY_FULL_MV) return 100;
    return static_cast<uint8_t>(
        ((static_cast<uint32_t>(millivolts - RC_TX_BATTERY_EMPTY_MV) * 100u) +
         ((RC_TX_BATTERY_FULL_MV - RC_TX_BATTERY_EMPTY_MV) / 2u)) /
        (RC_TX_BATTERY_FULL_MV - RC_TX_BATTERY_EMPTY_MV));
}

static rc_handset::display::BatteryState readTxBattery() {
    rc_handset::display::BatteryState battery{};
    const handset_power::BatterySnapshot powerBattery = handset_power::rcPowerSnapshot();
    if (powerBattery.batteryVoltageValid) {
        battery.available = true;
        battery.millivolts = powerBattery.batteryVoltageMv;
        battery.percent = powerBattery.batteryPercent;
        return battery;
    }
#ifdef RC_TX_BATTERY_ADC_PIN
    const uint16_t raw = readAveragedAdc(RC_TX_BATTERY_ADC_PIN);
    battery.available = true;
    battery.millivolts = static_cast<uint16_t>(
        (static_cast<uint32_t>(raw) * RC_TX_BATTERY_ADC_FULL_SCALE_MV + (kAdcMax / 2u)) / kAdcMax);
    battery.percent = percentFromMillivolts(battery.millivolts);
#endif
    return battery;
}

static void handleCrsfTelemetryFrame(const uint8_t frame[64], uint8_t frameLen) {
    if (frameLen < 4) return;
    const uint8_t type = frame[2];
    if (type == kCrsfFrameLinkStatistics && frame[1] == 12) {
        const uint32_t nowMs = millis();
        const int16_t rssiDbm = -static_cast<int16_t>(frame[3]);
        const uint8_t linkQuality = frame[5];
        const int8_t snrDb = static_cast<int8_t>(frame[6]);
        const handset_telemetry::HandsetTelemetryState& state = g_handsetTelemetry.state();
        g_handsetTelemetry.updateTxStatus(true,
                                          g_haveTxBindingStatus || state.haveExpectedUidCheck,
                                          g_haveTxBindingStatus ? g_txBindingStatus.uidCheck : state.expectedUidCheck,
                                          state.haveObservedUidCheck,
                                          state.observedUidCheck,
                                          rateIdFromCrsfRfMode(frame[8]),
                                          nowMs);
        g_handsetTelemetry.updateLoRaLink(linkQuality, rssiDbm, snrDb, nowMs);
    } else if (type == kCrsfFrameBatterySensor && frame[1] >= 10) {
        const uint16_t decivolts = static_cast<uint16_t>((frame[3] << 8) | frame[4]);
        if (decivolts > 0) {
            g_handsetTelemetry.updateRxBattery(static_cast<uint16_t>(decivolts * 100u),
                                               frame[10],
                                               millis());
        }
    }
}

static void serviceCrsfTelemetry() {
    uint8_t frame[64];
    uint8_t frameLen = 0;
    while (Serial2.available()) {
        const uint8_t byte = static_cast<uint8_t>(Serial2.read());
        BindingStatus ignoredStatus{};
        BindingResult ignoredResult = BindingResult::InvalidCommand;
        BindingControlOp ignoredOp = BindingControlOp::Get;
        parseCrsfBindingResponseFrame(byte, ignoredStatus, ignoredResult, ignoredOp);
        if (parseCrsfTelemetryByte(byte, frame, frameLen)) {
            handleCrsfTelemetryFrame(frame, frameLen);
        }
    }
}

static bool proxyTxBindingRequest(const BindingControlRequest& request, BindingStatus& status,
                                  BindingResult& result, BindingControlOp& responseOp) {
    uint8_t frame[64] = {};
    const size_t frameLen = encodeCrsfBindingRequestFrame(request, frame, sizeof(frame));
    if (frameLen == 0) return false;
    Serial2.write(frame, frameLen);

    uint8_t telemetryFrame[64];
    uint8_t telemetryFrameLen = 0;
    const uint32_t startMs = millis();
    while (static_cast<uint32_t>(millis() - startMs) < 750u) {
        while (Serial2.available()) {
            const uint8_t byte = static_cast<uint8_t>(Serial2.read());
            if (parseCrsfBindingResponseFrame(byte, status, result, responseOp) && responseOp == request.op) {
                if (result == BindingResult::Ok) publishTxBindingTelemetry(true, &status, millis());
                return true;
            }
            if (parseCrsfTelemetryByte(byte, telemetryFrame, telemetryFrameLen)) {
                handleCrsfTelemetryFrame(telemetryFrame, telemetryFrameLen);
            }
        }
        handset_power::rcPowerService();
        rc_handset::core1::loopOnceFallback();
        yield();
    }
    return false;
}

static void serviceTxBindingProbe() {
    const uint32_t nowMs = millis();
    const uint32_t intervalMs = g_haveTxBindingStatus ? 30000u : 2000u;
    if (g_lastTxBindingProbeMs != 0 &&
        static_cast<uint32_t>(nowMs - g_lastTxBindingProbeMs) < intervalMs) {
        return;
    }
    g_lastTxBindingProbeMs = nowMs;

    BindingControlRequest request{};
    request.op = BindingControlOp::Get;
    BindingStatus status{};
    BindingResult result = BindingResult::InvalidCommand;
    BindingControlOp responseOp = BindingControlOp::Get;
    if (!proxyTxBindingRequest(request, status, result, responseOp) || result != BindingResult::Ok) {
        publishTxBindingTelemetry(false, nullptr, nowMs);
    }
}

