xlrs-dev/xlrs/src/rc_rp2350_crsf_main.cpp
static void printBindingResponse(const handset_usb::ParsedCommand& command, const BindingStatus& status,
                                 BindingResult result, BindingControlOp op) {
    if (result != BindingResult::Ok) {
        Serial.print(handset_usb::formatErr(command, bindingResultName(result), "TX binding command failed").c_str());
        return;
    }
    Serial.print(handset_usb::formatOk(command, {
        {"target", "tx"},
        {"op", handset_usb::commandTypeName(command.type)},
        {"result", bindingResultName(result)},
        {"phrase", status.phrase},
        {"uid", uidHexString(status.uid)},
        {"uid_check", uidCheckHexString(status.uidCheck)},
        {"persisted", status.persisted ? "1" : "0"},
        {"requires_reboot", status.requiresReboot ? "1" : "0"},
    }).c_str());
}

static const handset_usb::Argument* commandArg(const handset_usb::ParsedCommand& command, const char* key) {
    for (const handset_usb::Argument& arg : command.arguments) {
        if (arg.key == key) return &arg;
    }
    return nullptr;
}

static std::vector<handset_usb::ResponseField> stateResponseFields() {
    refreshLiveState();
    const uint32_t nowMs = millis();
    if (g_liveState.haveChannels) {
        g_handsetTelemetry.updateLocalChannels(g_liveState.channels, nowMs);
    }
    handset_telemetry::PacketCounters counters{};
    counters.uplinkTransmitAttempts = g_liveState.framesSent;
    counters.uplinkTransmitSuccesses = g_liveState.framesSent;
    counters.rejectedOtaFrames = g_liveState.channelGuardRejects;
    counters.lostPackets = g_liveState.channelSpikeHolds;
    g_handsetTelemetry.updatePacketCounters(counters, nowMs);
    g_handsetTelemetry.setConfigFault(g_configFault, nowMs);
    g_handsetTelemetry.refresh(nowMs);
    const handset_telemetry::HandsetTelemetryState& telemetry = g_handsetTelemetry.state();

    uint16_t toggles[4] = {};
    for (uint8_t i = 0; i < 4; ++i) toggles[i] = g_liveState.channels[i + 4];
    const rc_handset::display::BatteryState txBattery = readTxBattery();
    std::vector<handset_usb::ResponseField> fields = {
        {"adc", currentAdcString()},
        {"ch", joinU16(g_liveState.channels, lora_link::kRcChannelCount)},
        {"toggles", joinU16(toggles, 4)},
        {"lq", std::to_string(telemetry.linkQuality)},
        {"rssi", std::to_string(telemetry.rssiDbm)},
        {"snr", std::to_string(telemetry.snrDb)},
        {"tx_present", telemetry.txStatus != handset_telemetry::FieldStatus::Missing ? "1" : "0"},
        {"tx_status", handset_telemetry::fieldStatusName(telemetry.txStatus)},
        {"link_status", handset_telemetry::fieldStatusName(telemetry.linkStatsStatus)},
        {"uid", telemetry.faults.bindingUidMismatch ? "mismatch" : (telemetry.faults.bindingUidMissing ? "missing" : "match")},
    };
    if (txBattery.available) {
        fields.push_back({"tx_batt_mv", std::to_string(txBattery.millivolts)});
    }
    if (telemetry.rxBatteryStatus != handset_telemetry::FieldStatus::Missing) {
        fields.push_back({"rx_batt_mv", std::to_string(telemetry.rxBattery.millivolts)});
    }
    if (g_haveTxBindingStatus) {
        fields.push_back({"tx_phrase", g_txBindingStatus.phrase});
        fields.push_back({"tx_uid", uidHexString(g_txBindingStatus.uid)});
        fields.push_back({"tx_uid_check", uidCheckHexString(g_txBindingStatus.uidCheck)});
        fields.push_back({"tx_requires_reboot", g_txBindingStatus.requiresReboot ? "1" : "0"});
    }
    return fields;
}

static bool handleRcV1Command(const char* line) {
    if (strncmp(line, "rc.v1", 5) != 0) return false;

    const handset_usb::ParseResult parsed = handset_usb::parseLine(line);
    if (!parsed.ok) {
        Serial.print(handset_usb::formatErr(false, 0, handset_usb::parseErrorName(parsed.error),
                                            parsed.errorMessage).c_str());
        return true;
    }

    const handset_usb::ParsedCommand& command = parsed.command;
    switch (command.type) {
        case handset_usb::CommandType::Hello:
            Serial.print(handset_usb::formatOk(command, {
                {"role", "rc_handset"},
                {"fw", "0.1"},
                {"caps", "state,stream_state,config,calibration,binding,tx_proxy"},
            }).c_str());
            return true;

        case handset_usb::CommandType::TxHello: {
            BindingControlRequest request{};
            request.op = BindingControlOp::Get;
            BindingStatus status{};
            BindingResult result = BindingResult::InvalidCommand;
            BindingControlOp responseOp = BindingControlOp::Get;
            if (!proxyTxBindingRequest(request, status, result, responseOp) || result != BindingResult::Ok) {
                publishTxBindingTelemetry(false, nullptr, millis());
                Serial.print(handset_usb::formatOk(command, {{"tx_present", "0"}}).c_str());
                return true;
            }
            Serial.print(handset_usb::formatOk(command, {
                {"tx_present", "1"},
                {"phrase", status.phrase},
                {"uid", uidHexString(status.uid)},
                {"uid_check", uidCheckHexString(status.uidCheck)},
                {"persisted", status.persisted ? "1" : "0"},
                {"requires_reboot", status.requiresReboot ? "1" : "0"},
            }).c_str());
            return true;
        }

        case handset_usb::CommandType::BindingGet:
        case handset_usb::CommandType::BindingSet:
        case handset_usb::CommandType::BindingClear:
        case handset_usb::CommandType::BindingVerify:
        case handset_usb::CommandType::BindingBind: {
            if (!command.target.empty() && command.target != "tx") {
                Serial.print(handset_usb::formatErr(command, "unsupported_target",
                                                    "RC USB can only proxy target=tx").c_str());
                return true;
            }

            BindingControlRequest request{};
            if (command.type == handset_usb::CommandType::BindingGet) request.op = BindingControlOp::Get;
            else if (command.type == handset_usb::CommandType::BindingSet) request.op = BindingControlOp::Set;
            else if (command.type == handset_usb::CommandType::BindingClear) request.op = BindingControlOp::Clear;
            else if (command.type == handset_usb::CommandType::BindingVerify) request.op = BindingControlOp::Verify;
            else request.op = BindingControlOp::Bind;

