xlrs-dev/xlrs/src/rc_rp2350_crsf_main.cpp
            if ((request.op == BindingControlOp::Set || request.op == BindingControlOp::Verify)) {
                if (!validateBindingPhrase(command.value.c_str())) {
                    Serial.print(handset_usb::formatErr(command, "invalid_phrase",
                                                        "phrase must be 1..32 printable bytes").c_str());
                    return true;
                }
                strncpy(request.phrase, command.value.c_str(), sizeof(request.phrase) - 1);
            }

            BindingStatus status{};
            BindingResult result = BindingResult::InvalidCommand;
            BindingControlOp responseOp = BindingControlOp::Get;
            if (!proxyTxBindingRequest(request, status, result, responseOp)) {
                Serial.print(handset_usb::formatErr(command, "tx_timeout",
                                                    "no TX binding response on CRSF UART").c_str());
                return true;
            }
            printBindingResponse(command, status, result, responseOp);
            return true;
        }

        case handset_usb::CommandType::GetConfig:
            Serial.print(handset_usb::formatOk(command, configResponseFields(g_pendingConfig.handsetConfig)).c_str());
            return true;

        case handset_usb::CommandType::SetConfig:
            if (!applyPendingConfigField(command.field, command.value)) {
                Serial.print(handset_usb::formatErr(command, "invalid_config_field",
                                                    "field or value is invalid").c_str());
                return true;
            }
            Serial.print(handset_usb::formatOk(command, {{"field", command.field}, {"value", command.value}}).c_str());
            return true;

        case handset_usb::CommandType::Apply:
            if (!handset_config::validateRcHandsetConfig(g_pendingConfig.handsetConfig)) {
                Serial.print(handset_usb::formatErr(command, "invalid_config",
                                                    "pending config failed validation").c_str());
                return true;
            }
            g_activeConfig.handsetConfig = g_pendingConfig.handsetConfig;
            publishActiveConfig();
            Serial.print(handset_usb::formatOk(command, {{"generation", std::to_string(g_activeConfig.generation)}}).c_str());
            return true;

        case handset_usb::CommandType::Save:
            if (saveRcConfig()) {
                Serial.print(handset_usb::formatOk(command, {{"persisted", "1"}}).c_str());
            } else {
                Serial.print(handset_usb::formatErr(command, "persist_failed",
                                                    "failed to encode or commit config").c_str());
            }
            return true;

        case handset_usb::CommandType::ResetDefaults:
            if (!command.target.empty() && command.target != "rc_config") {
                Serial.print(handset_usb::formatErr(command, "unsupported_target",
                                                    "reset_defaults supports target=rc_config").c_str());
                return true;
            }
            g_activeConfig.handsetConfig = handset_config::defaultRcHandsetConfig();
            g_pendingConfig = g_activeConfig;
            publishActiveConfig();
            Serial.print(handset_usb::formatOk(command, configResponseFields(g_pendingConfig.handsetConfig)).c_str());
            return true;

        case handset_usb::CommandType::CalStart:
            collectCurrentAdc(g_calCenter);
            memcpy(g_calMin, g_calCenter, sizeof(g_calMin));
            memcpy(g_calMax, g_calCenter, sizeof(g_calMax));
            g_calibrating = true;
            Serial.print(handset_usb::formatOk(command, {{"adc", joinU16(g_calCenter, handset_config::kRcHandsetAxisCount)}}).c_str());
            return true;

        case handset_usb::CommandType::CalSample: {
            if (!g_calibrating) {
                Serial.print(handset_usb::formatErr(command, "not_calibrating",
                                                    "run cal_start before cal_sample").c_str());
                return true;
            }
            uint16_t adc[handset_config::kRcHandsetAxisCount];
            collectCurrentAdc(adc);
            for (uint8_t axis = 0; axis < handset_config::kRcHandsetAxisCount; ++axis) {
                if (adc[axis] < g_calMin[axis]) g_calMin[axis] = adc[axis];
                if (adc[axis] > g_calMax[axis]) g_calMax[axis] = adc[axis];
            }
            Serial.print(handset_usb::formatOk(command, {
                {"adc", joinU16(adc, handset_config::kRcHandsetAxisCount)},
                {"cal_min", joinU16(g_calMin, handset_config::kRcHandsetAxisCount)},
                {"cal_max", joinU16(g_calMax, handset_config::kRcHandsetAxisCount)},
            }).c_str());
            return true;
        }

        case handset_usb::CommandType::CalFinish: {
            if (!g_calibrating) {
                Serial.print(handset_usb::formatErr(command, "not_calibrating",
                                                    "run cal_start before cal_finish").c_str());
                return true;
            }
            collectCurrentAdc(g_calCenter);
            for (uint8_t axis = 0; axis < handset_config::kRcHandsetAxisCount; ++axis) {
                if (g_calMin[axis] >= g_calCenter[axis]) g_calMin[axis] = g_calCenter[axis] > 10 ? g_calCenter[axis] - 10 : 0;
                if (g_calMax[axis] <= g_calCenter[axis]) g_calMax[axis] = static_cast<uint16_t>(g_calCenter[axis] + 10);
                if (g_calMax[axis] > handset_config::kRcHandsetAdcMax) g_calMax[axis] = handset_config::kRcHandsetAdcMax;
                g_pendingConfig.handsetConfig.axes[axis].calibration.min = g_calMin[axis];
                g_pendingConfig.handsetConfig.axes[axis].calibration.center = g_calCenter[axis];
                g_pendingConfig.handsetConfig.axes[axis].calibration.max = g_calMax[axis];
            }
            g_calibrating = false;
            if (!handset_config::validateRcHandsetConfig(g_pendingConfig.handsetConfig)) {
                Serial.print(handset_usb::formatErr(command, "invalid_calibration",
                                                    "sampled calibration failed validation").c_str());
                return true;
            }
            g_activeConfig.handsetConfig = g_pendingConfig.handsetConfig;
            publishActiveConfig();
            bool saveRequested = false;
            if (const handset_usb::Argument* saveArg = commandArg(command, "save")) {
                saveRequested = saveArg->value == "1" || saveArg->value == "true";
            }
            if (saveRequested && !saveRcConfig()) {
                Serial.print(handset_usb::formatErr(command, "persist_failed",
                                                    "calibration applied but save failed").c_str());
                return true;
            }
            Serial.print(handset_usb::formatOk(command, configResponseFields(g_pendingConfig.handsetConfig)).c_str());
            return true;
        }

        case handset_usb::CommandType::StreamState: {
            uint32_t interval = 100;
            bool enabled = true;
            if (const handset_usb::Argument* intervalArg = commandArg(command, "interval_ms")) {
                interval = static_cast<uint32_t>(strtoul(intervalArg->value.c_str(), nullptr, 10));
            }
            if (const handset_usb::Argument* enabledArg = commandArg(command, "enabled")) {
                enabled = enabledArg->value != "0" && enabledArg->value != "false";
            } else if (!command.value.empty()) {
                enabled = command.value != "0" && command.value != "off";
            }
            if (interval < 50) interval = 50;
            if (interval > 2000) interval = 2000;
            g_streamStateEnabled = enabled;
            g_streamStateIntervalMs = interval;
            g_lastStreamStateMs = 0;
            Serial.print(handset_usb::formatOk(command, {
                {"enabled", enabled ? "1" : "0"},
                {"interval_ms", std::to_string(interval)},
            }).c_str());
            return true;
        }

        case handset_usb::CommandType::State: {
            Serial.print(handset_usb::formatOk(command, stateResponseFields()).c_str());
            return true;
        }

        default:
            Serial.print(handset_usb::formatErr(command, "unsupported_command",
                                                "command is not wired in RC firmware").c_str());
            return true;
    }
}

static void printChannels() {
    for (uint8_t i = 0; i < kRcChannelCount; ++i) {
        if (i) Serial.print(',');
        Serial.print(g_liveState.channels[i]);
    }
    Serial.println();
}

static void serviceCli() {
    static char line[128];
    static uint8_t pos = 0;
    while (Serial.available()) {
        const char c = static_cast<char>(Serial.read());
        if (c == '\r') continue;
        if (c == '\n') {
            line[pos] = '\0';
            if (handleRcV1Command(line)) {
                pos = 0;
                continue;
            }
            refreshLiveState();
            if (strcmp(line, "status") == 0) {
                Serial.printf("role=rc-rp2350 core1=%u baud=%lu frames=%lu cfg=%lu ack=%lu guard=%lu hold=%lu tx_phrase=%s tx_uid=%s ch=%u,%u,%u,%u\n",
                              rc_handset::core1::isCore1Started() ? 1u : 0u,
                              static_cast<unsigned long>(kCrsfBaud),
                              static_cast<unsigned long>(g_liveState.framesSent),
                              static_cast<unsigned long>(g_liveState.appliedConfigGeneration),
                              static_cast<unsigned long>(rc_handset::core1::ackedConfigGeneration()),
                              static_cast<unsigned long>(g_liveState.channelGuardRejects),
                              static_cast<unsigned long>(g_liveState.channelSpikeHolds),
                              g_haveTxBindingStatus ? g_txBindingStatus.phrase : "unknown",
                              g_haveTxBindingStatus ? uidCheckHexString(g_txBindingStatus.uidCheck).c_str() : "unknown",
                              g_liveState.channels[0], g_liveState.channels[1],
                              g_liveState.channels[2], g_liveState.channels[3]);
                handset_power::rcPowerPrintStatus();
            } else if (strcmp(line, "channels") == 0) {
                printChannels();
            } else if (strcmp(line, "power") == 0) {
                handset_power::rcPowerPrintStatus();
            } else if (strcmp(line, "reboot") == 0) {
                rp2040.reboot();
            } else if (line[0]) {
                Serial.println("commands: status | channels | power | reboot");
            }
            pos = 0;
        } else if (pos < sizeof(line) - 1) {
            line[pos++] = c;
        }
    }
}

static rc_handset::display::Screen displayScreenForTime(uint32_t nowMs) {
    switch ((nowMs / kDisplayPageMs) % 4u) {
        case 0:
            return rc_handset::display::Screen::MainStatus;
        case 1:
            return rc_handset::display::Screen::ChannelMonitor;
        case 2:
            return rc_handset::display::Screen::ConfigSummary;
        default:
            return rc_handset::display::Screen::BindingStatus;
    }
}

static void populateDisplayState(rc_handset::display::DisplayState& state,
                                 rc_handset::display::Screen screen) {
    state = rc_handset::display::DisplayState{};
    state.screen = screen;
    state.txBattery = readTxBattery();

    const uint32_t nowMs = millis();

    refreshLiveState();
    if (g_liveState.haveChannels) {
        g_handsetTelemetry.updateLocalChannels(g_liveState.channels, nowMs);
    }
    handset_telemetry::PacketCounters counters{};
    counters.uplinkTransmitAttempts = g_liveState.framesSent;
    counters.uplinkTransmitSuccesses = g_liveState.framesSent;
    counters.rejectedOtaFrames = g_liveState.channelGuardRejects;
    counters.lostPackets = g_liveState.channelSpikeHolds;
    g_handsetTelemetry.updatePacketCounters(counters, nowMs);
    g_handsetTelemetry.refresh(nowMs);
    const handset_telemetry::HandsetTelemetryState& telemetry = g_handsetTelemetry.state();

    state.rxBattery.available = telemetry.rxBatteryStatus == handset_telemetry::FieldStatus::Valid;
    state.rxBattery.millivolts = telemetry.rxBattery.millivolts;
    state.rxBattery.percent = telemetry.rxBattery.percent;
    state.link.connected = telemetry.txPresent &&
                           telemetry.txStatus == handset_telemetry::FieldStatus::Valid &&
                           telemetry.linkStatsStatus == handset_telemetry::FieldStatus::Valid;
    state.link.metricsAvailable = telemetry.linkStatsStatus == handset_telemetry::FieldStatus::Valid;
    state.link.bindingMismatch = telemetry.faults.bindingUidMismatch;
    state.link.rateName = handset_telemetry::rateName(telemetry.activeRate);
    state.link.linkQuality = telemetry.linkQuality;
    state.link.rssiDbm = telemetry.rssiDbm;
    state.link.snrDb = telemetry.snrDb;

