xlrs-dev/xlrs/src/rc_rp2350_crsf_main.cpp
    state.channels.channelsAvailable = g_liveState.haveChannels;
    state.channels.aileron = g_liveState.channels[0];
    state.channels.elevator = g_liveState.channels[1];
    state.channels.rudder = g_liveState.channels[2];
    state.channels.throttle = g_liveState.channels[3];
    for (uint8_t i = 0; i < rc_handset::display::kMonitorToggleCount; ++i) {
        state.channels.toggles[i] = g_liveState.channels[i + 4];
    }

    state.config.rateName = handset_telemetry::rateName(telemetry.activeRate);
    state.config.bindingPhrase = displayBindingPhrase();
    state.config.calibrationValid = g_liveState.haveChannels;
    state.config.framesSent = g_liveState.framesSent;
    state.config.guardRejects = g_liveState.channelGuardRejects;
    state.config.spikeHolds = g_liveState.channelSpikeHolds;

    state.binding.mismatch = telemetry.faults.bindingUidMismatch;
    if (telemetry.faults.configFault) {
        state.binding.message = "Config fault";
    } else if (telemetry.faults.bindingUidMismatch) {
        state.binding.message = "Receiver UID differs";
    } else if (telemetry.faults.bindingUidMissing) {
        state.binding.message = "TX UID unchecked";
    } else if (telemetry.linkStatsStatus == handset_telemetry::FieldStatus::Valid) {
        state.binding.message = "Telemetry OK";
    } else {
        state.binding.message = "No receiver telemetry";
    }
}

static void serviceDisplay() {
    const uint32_t nowMs = millis();
    if (static_cast<uint32_t>(nowMs - g_lastDisplayMs) < kDisplayIntervalMs) return;
    g_lastDisplayMs = nowMs;

    rc_handset::display::DisplayState state;
    populateDisplayState(state, displayScreenForTime(nowMs));
    g_display.show(state);
}

static void printStateStreamLine() {
    Serial.print("rc.v1 state");
    for (const handset_usb::ResponseField& field : stateResponseFields()) {
        Serial.print(' ');
        Serial.print(field.key.c_str());
        Serial.print('=');
        Serial.print(handset_usb::percentEncode(field.value).c_str());
    }
    Serial.print('\n');
}

static void serviceStateStream() {
    if (!g_streamStateEnabled || g_streamStateIntervalMs == 0) return;
    const uint32_t nowMs = millis();
    if (g_lastStreamStateMs != 0 &&
        static_cast<uint32_t>(nowMs - g_lastStreamStateMs) < g_streamStateIntervalMs) {
        return;
    }
    g_lastStreamStateMs = nowMs;
    printStateStreamLine();
}

static void showBootScreen(uint8_t progressPercent, const char* message) {
    rc_handset::display::DisplayState state;
    state.screen = rc_handset::display::Screen::Boot;
    state.bootProgressPercent = progressPercent;
    state.bootMessage = message;
    g_display.show(state);
}

void setup() {
    Serial.begin(115200);
    Serial.ignoreFlowControl(true);
    g_display.begin();
    showBootScreen(15, "Power init");
    handset_power::rcPowerBegin();
    showBootScreen(25, "Core 0 init");
    loadRcConfig();
    publishActiveConfig();
    showBootScreen(50, "Core 1 launch");
    rc_handset::core1::begin();
    refreshLiveState();
    showBootScreen(80, "CRSF ready");
    Serial.println("RC RP2350 CRSF output");
    Serial.printf("Core1=%u baud=%lu interval_us=%lu\n",
                  rc_handset::core1::isCore1Started() ? 1u : 0u,
                  static_cast<unsigned long>(kCrsfBaud),
                  static_cast<unsigned long>(rc_handset::core1::kDefaultCrsfFrameIntervalUs));
    showBootScreen(100, "Ready");
}

void loop() {
    handset_power::rcPowerService();
    rc_handset::core1::loopOnceFallback();
    serviceCrsfTelemetry();
    serviceCli();
    serviceTxBindingProbe();
    serviceStateStream();
    serviceDisplay();
    yield();
}

#endif // UNIT_TEST
